yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3166.h
/* Resistor control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char KPU10       : 1;
  unsigned char KPU400      : 1;
  unsigned char KPD10       : 1;
  unsigned char KPD400      : 1;
} __BITS_RI_RCR;
#endif
__IO_REG8_BIT(RI_RCR,      0x543F, __READ_WRITE, __BITS_RI_RCR);


/*-------------------------------------------------------------------------
 *      RI bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define RI_ICR1_IC2CS            RI_ICR1_bit.IC2CS

#define RI_ICR2_IC3CS            RI_ICR2_bit.IC3CS

#define RI_IOIR1_CH1I            RI_IOIR1_bit.CH1I
#define RI_IOIR1_CH4I            RI_IOIR1_bit.CH4I
#define RI_IOIR1_CH7I            RI_IOIR1_bit.CH7I
#define RI_IOIR1_CH10I           RI_IOIR1_bit.CH10I
#define RI_IOIR1_CH13I           RI_IOIR1_bit.CH13I
#define RI_IOIR1_CH16I           RI_IOIR1_bit.CH16I
#define RI_IOIR1_CH19I           RI_IOIR1_bit.CH19I
#define RI_IOIR1_CH22I           RI_IOIR1_bit.CH22I

#define RI_IOIR2_CH2I            RI_IOIR2_bit.CH2I
#define RI_IOIR2_CH5I            RI_IOIR2_bit.CH5I
#define RI_IOIR2_CH8I            RI_IOIR2_bit.CH8I
#define RI_IOIR2_CH11I           RI_IOIR2_bit.CH11I
#define RI_IOIR2_CH14I           RI_IOIR2_bit.CH14I
#define RI_IOIR2_CH17I           RI_IOIR2_bit.CH17I
#define RI_IOIR2_CH20I           RI_IOIR2_bit.CH20I
#define RI_IOIR2_CH23I           RI_IOIR2_bit.CH23I

#define RI_IOIR3_CH3I            RI_IOIR3_bit.CH3I
#define RI_IOIR3_CH6I            RI_IOIR3_bit.CH6I
#define RI_IOIR3_CH9I            RI_IOIR3_bit.CH9I
#define RI_IOIR3_CH12I           RI_IOIR3_bit.CH12I
#define RI_IOIR3_CH15I           RI_IOIR3_bit.CH15I
#define RI_IOIR3_CH18I           RI_IOIR3_bit.CH18I
#define RI_IOIR3_CH21I           RI_IOIR3_bit.CH21I
#define RI_IOIR3_CH24I           RI_IOIR3_bit.CH24I

#define RI_IOCMR1_CH1M           RI_IOCMR1_bit.CH1M
#define RI_IOCMR1_CH4M           RI_IOCMR1_bit.CH4M
#define RI_IOCMR1_CH7M           RI_IOCMR1_bit.CH7M
#define RI_IOCMR1_CH10M          RI_IOCMR1_bit.CH10M
#define RI_IOCMR1_CH13M          RI_IOCMR1_bit.CH13M
#define RI_IOCMR1_CH16M          RI_IOCMR1_bit.CH16M
#define RI_IOCMR1_CH19M          RI_IOCMR1_bit.CH19M
#define RI_IOCMR1_CH22M          RI_IOCMR1_bit.CH22M

#define RI_IOCMR2_CH2M           RI_IOCMR2_bit.CH2M
#define RI_IOCMR2_CH5M           RI_IOCMR2_bit.CH5M
#define RI_IOCMR2_CH8M           RI_IOCMR2_bit.CH8M
#define RI_IOCMR2_CH11M          RI_IOCMR2_bit.CH11M
#define RI_IOCMR2_CH14M          RI_IOCMR2_bit.CH14M
#define RI_IOCMR2_CH17M          RI_IOCMR2_bit.CH17M
#define RI_IOCMR2_CH20M          RI_IOCMR2_bit.CH20M
#define RI_IOCMR2_CH23M          RI_IOCMR2_bit.CH23M

#define RI_IOCMR3_CH3M           RI_IOCMR3_bit.CH3M
#define RI_IOCMR3_CH6M           RI_IOCMR3_bit.CH6M
#define RI_IOCMR3_CH9M           RI_IOCMR3_bit.CH9M
#define RI_IOCMR3_CH12M          RI_IOCMR3_bit.CH12M
#define RI_IOCMR3_CH53M          RI_IOCMR3_bit.CH53M
#define RI_IOCMR3_CH18M          RI_IOCMR3_bit.CH18M
#define RI_IOCMR3_CH21M          RI_IOCMR3_bit.CH21M
#define RI_IOCMR3_CH24M          RI_IOCMR3_bit.CH24M

#define RI_IOSR1_CH1E            RI_IOSR1_bit.CH1E
#define RI_IOSR1_CH4E            RI_IOSR1_bit.CH4E
#define RI_IOSR1_CH7E            RI_IOSR1_bit.CH7E
#define RI_IOSR1_CH10E           RI_IOSR1_bit.CH10E
#define RI_IOSR1_CH13E           RI_IOSR1_bit.CH13E
#define RI_IOSR1_CH16E           RI_IOSR1_bit.CH16E
#define RI_IOSR1_CH19E           RI_IOSR1_bit.CH19E
#define RI_IOSR1_CH22E           RI_IOSR1_bit.CH22E

#define RI_IOSR2_CH2E            RI_IOSR2_bit.CH2E
#define RI_IOSR2_CH5E            RI_IOSR2_bit.CH5E
#define RI_IOSR2_CH8E            RI_IOSR2_bit.CH8E
#define RI_IOSR2_CH11E           RI_IOSR2_bit.CH11E
#define RI_IOSR2_CH14E           RI_IOSR2_bit.CH14E
#define RI_IOSR2_CH17E           RI_IOSR2_bit.CH17E
#define RI_IOSR2_CH20E           RI_IOSR2_bit.CH20E
#define RI_IOSR2_CH23E           RI_IOSR2_bit.CH23E

#define RI_IOSR3_CH3E            RI_IOSR3_bit.CH3E
#define RI_IOSR3_CH6E            RI_IOSR3_bit.CH6E
#define RI_IOSR3_CH9E            RI_IOSR3_bit.CH9E
#define RI_IOSR3_CH12E           RI_IOSR3_bit.CH12E
#define RI_IOSR3_CH15E           RI_IOSR3_bit.CH15E
#define RI_IOSR3_CH18E           RI_IOSR3_bit.CH18E
#define RI_IOSR3_CH21E           RI_IOSR3_bit.CH21E
#define RI_IOSR3_CH24E           RI_IOSR3_bit.CH24E

#define RI_IOGCR_IOM1            RI_IOGCR_bit.IOM1
#define RI_IOGCR_IOM2            RI_IOGCR_bit.IOM2
#define RI_IOGCR_IOM3            RI_IOGCR_bit.IOM3

#define RI_ASCR1_AS0             RI_ASCR1_bit.AS0
#define RI_ASCR1_AS1             RI_ASCR1_bit.AS1
#define RI_ASCR1_AS2             RI_ASCR1_bit.AS2
#define RI_ASCR1_AS3             RI_ASCR1_bit.AS3
#define RI_ASCR1_AS4             RI_ASCR1_bit.AS4
#define RI_ASCR1_AS5             RI_ASCR1_bit.AS5
#define RI_ASCR1_AS6             RI_ASCR1_bit.AS6
#define RI_ASCR1_AS7             RI_ASCR1_bit.AS7

#define RI_ASCR2_AS8             RI_ASCR2_bit.AS8
#define RI_ASCR2_AS14            RI_ASCR2_bit.AS14

#define RI_RCR_KPU10             RI_RCR_bit.KPU10
#define RI_RCR_KPU400            RI_RCR_bit.KPU400
#define RI_RCR_KPD10             RI_RCR_bit.KPD10
#define RI_RCR_KPD400            RI_RCR_bit.KPD400

#endif

/*-------------------------------------------------------------------------
 *      RI bit masks
 *-----------------------------------------------------------------------*/
#define MASK_RI_ICR1_IC2CS       0x1F

#define MASK_RI_ICR2_IC3CS       0x1F

#define MASK_RI_IOIR1_CH1I       0x01
#define MASK_RI_IOIR1_CH4I       0x02
#define MASK_RI_IOIR1_CH7I       0x04
#define MASK_RI_IOIR1_CH10I      0x08
#define MASK_RI_IOIR1_CH13I      0x10
#define MASK_RI_IOIR1_CH16I      0x20
#define MASK_RI_IOIR1_CH19I      0x40
#define MASK_RI_IOIR1_CH22I      0x80

#define MASK_RI_IOIR2_CH2I       0x01
#define MASK_RI_IOIR2_CH5I       0x02
#define MASK_RI_IOIR2_CH8I       0x04
#define MASK_RI_IOIR2_CH11I      0x08
#define MASK_RI_IOIR2_CH14I      0x10
#define MASK_RI_IOIR2_CH17I      0x20
#define MASK_RI_IOIR2_CH20I      0x40
#define MASK_RI_IOIR2_CH23I      0x80

#define MASK_RI_IOIR3_CH3I       0x01
#define MASK_RI_IOIR3_CH6I       0x02
#define MASK_RI_IOIR3_CH9I       0x04
#define MASK_RI_IOIR3_CH12I      0x08
#define MASK_RI_IOIR3_CH15I      0x10
#define MASK_RI_IOIR3_CH18I      0x20
#define MASK_RI_IOIR3_CH21I      0x40
#define MASK_RI_IOIR3_CH24I      0x80

#define MASK_RI_IOCMR1_CH1M      0x01
#define MASK_RI_IOCMR1_CH4M      0x02
#define MASK_RI_IOCMR1_CH7M      0x04
#define MASK_RI_IOCMR1_CH10M     0x08
#define MASK_RI_IOCMR1_CH13M     0x10
#define MASK_RI_IOCMR1_CH16M     0x20
#define MASK_RI_IOCMR1_CH19M     0x40
#define MASK_RI_IOCMR1_CH22M     0x80

